{
  "animated_text": "From Software Development to Ensuring Quality Through Testing",
  "developer_description": "Once an experienced web developer, I am now a dedicated test engineer, transforming ideas into robust and reliable applications by implementing comprehensive testing strategies and ensuring the highest standards of quality.",
  "resume_button": "Resume",
  "contact_link": "Contact",
  "profile_pic_alt": "Marek's Profile Picture",
  "lightbulb_pic_alt": "Lightbulb",
  "biography_heading": "Biography",
  "biography_paragraph_1": "As a tech industry professional, I began my journey at Geeknauts, mastering web and mobile application development through solo and team projects. This role shaped my technical skills and collaborative abilities.",
  "biography_paragraph_2": "I broadened my experience at RabeSoft and VisualSoft as a Frontend Engineer, focusing on UI/UX with React Native. At Eternis, as a Full-Stack Engineer, I employed Next.js, Chakra UI, and Strapi to create responsive web interfaces and manage content effectively, showcasing my versatility in software development.",
  "biography_paragraph_3": "Additionally, I worked at Thundersoft as a Test Engineer and at UBIQUITY SERVICE as a Quality Assurance professional, further broadening my technical expertise and understanding of software quality standards.",
  "satisfied_clients_heading": "Satisfied Clients",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Projects Completed",
  "years_of_experience_heading": "Years of Experience",
  "skills_heading": "My Skills",
  "experience_heading": "Experience",
  "education_heading": "Education",
  "passion_fuels_purpose": "Passion Fuels Purpose!",
  "home": "Home",
  "about": "About",
  "projects": "Projects",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "skills": "Skills",
  "experienceTitle": "Experience",
  "workDescriptionGeeknauts": "I worked on web and mobile application development both in a team and independently; as part of a team, I collaborated on complex projects for various clients, and in solo roles, I managed the full spectrum of development tasks from concept to completion.",
  "workDescriptionRabeSoft": "I took on the role of a frontend engineer for the mobile DinnerDate app, focusing on enhancing user interface and experience. My work involved implementing interactive design elements and ensuring seamless functionality across various devices.",
  "workDescriptionVisualSoft": "I was the sole frontend developer for the Smartkid app, leveraging React Native for cross-platform functionality and Fastlane for streamlined deployment. My work involved building a rich user interface and integrating key features using modern tools like Firebase and Redux for robust app performance.",
  "workDescriptionEternis": "During the development of the Eternis website, I employed Next.js and Strapi for efficient performance and content management. My contribution also involved implementing Chakra UI to achieve a responsive and user-friendly interface.",
  "workDescriptionThunderSoft": "As a Quality Assurance Specialist at ThunderSoft, I directly engage in software testing. My work also involves collaborating with the development team to improve product functionality and user experience, contributing to the high quality and efficiency of the software.",
  "educationTitle": "Education",
  "bachelor": "Bachelor Of Science In Computer Science",
  "bachelorAcademy": "Cracow University of Technology",
  "bachelorInfo": "Relevant courses included Data Structures and Algorithms, Computer Systems Engineering, and Artificial Intelligence",
  "masters": "Master of Science in Computer Science Specialization in Cybersecurity",
  "mastersAcademy": "Cracow University of Technology",
  "mastersInfo": "The Master's coursework included hands-on experience with security assessment and penetration testing tools such as Nmap, SonarQube, and Burp Suite, emphasizing practical approaches to vulnerability analysis and network security.",
  "allRightsReserved": "All Rights Reserved.",
  "buildWithLove": "Build With",
  "by": "by",
  "sayHello": "Say Hello"
}
