{
  "animated_text": "From Software Development to Ensuring Quality Through Testing",
  "developer_description": "With a background in full-stack development, I now focus on ensuring quality across the entire product lifecycle. I use both manual and automated testing to validate complex systems, uncover edge cases and support fast, predictable releases. My goal is simple: help teams ship stable, reliable and user-focused applications.",
  "resume_button": "Resume",
  "page_title": "Marek Święchowicz",
  "page_description": "Discover the projects, portfolio, and professional background of Marek Święchowicz.",
  "about_me_content": "Learn more about Marek Święchowicz, a Quality Assurance Engineer. Discover my journey, projects, and what drives my passion for programming.",
  "contact_link": "Contact",
  "profile_pic_alt": "Marek's Profile Picture",
  "lightbulb_pic_alt": "Lightbulb",
  "biography_heading": "Biography",
  "biography_paragraph_1": "I began my tech journey at Geeknauts, building a strong foundation in web and mobile development. Working across both individual and team projects, I focused on creating intuitive user experiences and reliable application features, gaining versatility and a solid engineering mindset.",
  "biography_paragraph_2": "As my career evolved through Thundersoft and 3mk, I transitioned into quality engineering, taking ownership of testing across complex systems. This path eventually led me to SiriusXM, where I now focus on automation, integration validation and system-level reliability for large-scale, real-world applications used across the automotive ecosystem.",
  "satisfied_clients_heading": "Satisfied Clients",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Projects Completed",
  "years_of_experience_heading": "Years of Experience",
  "skills_heading": "My Skills",
  "experience_heading": "Experience",
  "education_heading": "Education",
  "passion_fuels_purpose": "Passion Fuels Purpose!",
  "home": "Home",
  "about": "About",
  "projects": "Projects",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "skills": "Skills",
  "experienceTitle": "Experience",
  "workDescriptionGeeknauts": "I worked on web and mobile application development, contributing to both team-based and independent projects. I delivered frontend and backend features, improved performance and usability, and supported release workflows. This role built the engineering foundation that later enabled my transition into quality engineering and automation.",
  "workDescriptionThunderSoft": "As a Test Engineer at ThunderSoft, I worked on infotainment and connected-car systems, performing functional and integration testing in embedded environments. My responsibilities included analyzing logs, validating backend communication flows, and supporting release readiness. I collaborated closely with developers to improve overall system stability.",
  "workDescription3MK": "At 3MK, I was responsible for end-to-end quality across web, backend and mobile applications. I created and executed test plans, performed exploratory and regression testing, and supported early automation using Playwright and TypeScript. Working as the sole QA, I ensured high coverage, clear reporting, and direct communication with developers and product stakeholders.",
  "workDescriptionSiriusXM": "As a Quality Engineer at SiriusXM, I work on the validation of in-vehicle applications used across a large automotive ecosystem. I focus on system reliability, automation, and integration testing to ensure high-quality releases in real-world conditions. My responsibilities include designing and executing test strategies, investigating system-level issues, and collaborating with engineering teams across Ireland and the US.",
  "educationTitle": "Education",
  "bachelor": "Bachelor Of Science In Computer Science",
  "bachelorAcademy": "Cracow University of Technology",
  "bachelorInfo": "Relevant courses included Data Structures and Algorithms, Computer Systems Engineering, and Artificial Intelligence",
  "masters": "Master of Science in Computer Science, Specialization in Cybersecurity",
  "mastersAcademy": "Cracow University of Technology",
  "mastersInfo": "The Master's coursework included hands-on experience with security assessment and penetration testing tools such as Nmap, SonarQube, and Burp Suite, emphasizing practical approaches to vulnerability analysis and network security.",
  "allRightsReserved": "All Rights Reserved.",
  "buildWithLove": "Build With",
  "by": "by",
  "sayHello": "Say Hello",
  "projects_header": "Imagination Trumps Knowledge!",
  "Marka": "Mark",
  "CKEditor_title": "REST API and CKEditor 5 Real-Time Collaboration Showcase",
  "CKEditor_summary": "This project demonstrates my expertise in configuring and testing REST APIs, with a focus on real-time collaboration features. It includes several projects and tasks, each addressing specific aspects of API integration and testing.",
  "CKEditor_projectType": "Featured Project",
  "T-mobile_projectType": "UI automation testing",
  "T-mobile_title": "T-Mobile Product Purchase Automation",
  "T-mobile_summary": "This project demonstrates automated testing of the T-Mobile website's product purchase flow using Selenium WebDriver with Java and Cucumber.",
  "TMExpress_projectType": "Static nextjs site",
  "portfolio_title": "My website",
  "portfolio_projectType": "portfolio",
  "portfolio_summary": "This portfolio website was created using Next.js, Tailwind CSS, and TypeScript."
}
