{
  "animated_text": "From Software Development to Ensuring Quality Through Testing",
  "developer_description": "Once an experienced web developer, I am now a dedicated test engineer, transforming ideas into robust and reliable applications by implementing comprehensive testing strategies and ensuring the highest standards of quality.",
  "resume_button": "Resume",
  "contact_link": "Contact",
  "profile_pic_alt": "Marek's Profile Picture",
  "lightbulb_pic_alt": "Lightbulb",
  "biography_heading": "Biography",
  "biography_paragraph_1": "As a tech industry professional, I've built a solid foundation at Geeknauts, where my journey in web and mobile application development began. At Geeknauts, I embraced both solo and team projects, mastering the art of navigating complex challenges and delivering innovative solutions. This role was pivotal in shaping my technical skills and collaborative abilities, setting the stage for my future endeavors.",
  "biography_paragraph_2": "My expertise led to opportunities where I was loaned out to other companies, allowing me to broaden my experience across diverse environments. At RabeSoft and VisualSoft, I took on the mantle of a Frontend Engineer, diving deep into user interface design and user experience enhancements. Utilizing tools like React Native and Firebase, I contributed to the development of applications that were not only visually appealing but also functionally robust. My stint at Eternis as a Full-Stack Engineer further expanded my skill set, where I employed Next.js and Chakra UI to create responsive web interfaces, demonstrating my versatility in handling various aspects of software development.",
  "biography_paragraph_3": "In every project, I strive to use my skills and enthusiasm to realize your vision. I'm eagerly looking forward to bringing my knowledge and fresh perspective to your next project.",
  "satisfied_clients_heading": "Satisfied Clients",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Projects Completed",
  "years_of_experience_heading": "Years of Experience",
  "skills_heading": "My Skills",
  "experience_heading": "Experience",
  "education_heading": "Education",
  "passion_fuels_purpose": "Passion Fuels Purpose!",
  "home": "Home",
  "about": "About",
  "projects": "Projects",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "skills": "Skills",
  "experienceTitle": "Experience",
  "workDescriptionGeeknauts": "I worked on web and mobile application development both in a team and independently; as part of a team, I collaborated on complex projects for various clients, and in solo roles, I managed the full spectrum of development tasks from concept to completion.",
  "workDescriptionRabeSoft": "I took on the role of a frontend engineer for the mobile DinnerDate app, focusing on enhancing user interface and experience. My work involved implementing interactive design elements and ensuring seamless functionality across various devices.",
  "workDescriptionVisualSoft": "I was the sole frontend developer for the Smartkid app, leveraging React Native for cross-platform functionality and Fastlane for streamlined deployment. My work involved building a rich user interface and integrating key features using modern tools like Firebase and Redux for robust app performance.",
  "workDescriptionEternis": "During the development of the Eternis website, I employed Next.js and Strapi for efficient performance and content management. My contribution also involved implementing Chakra UI to achieve a responsive and user-friendly interface.",
  "workDescriptionThunderSoft": "As a Quality Assurance Specialist at ThunderSoft, I directly engage in software testing. My work also involves collaborating with the development team to improve product functionality and user experience, contributing to the high quality and efficiency of the software.",
  "educationTitle": "Education",
  "batchelor": "Bachelor Of Science In Computer Science",
  "batchelorAcademy": "Cracow University of Technology",
  "batchelorInfo": "Relevant courses included Data Structures and Algorithms, Computer Systems Engineering, and Artificial Intelligence",
  "masters": "Master of Science in Computer Science Specialization in Cybersecurity",
  "mastersAcademy": "Cracow University of Technology",
  "mastersInfo": "The Master's coursework included hands-on experience with security assessment and penetration testing tools such as Nmap, SonarQube, and Burp Suite, emphasizing practical approaches to vulnerability analysis and network security.",
  "allRightsReserved": "All Rights Reserved.",
  "buildWithLove": "Build With",
  "by": "by",
  "sayHello": "Say Hello"
}
