{
  "animated_text": "From Software Development to Ensuring Quality Through Testing",
  "developer_description": "Once an experienced web developer, I am now a dedicated test engineer, transforming ideas into robust and reliable applications by implementing comprehensive testing strategies and ensuring the highest standards of quality.",
  "resume_button": "Resume",
  "page_title": "Marek Święchowicz",
  "page_description": "Discover the projects, portfolio, and professional background of Marek Święchowicz.",
  "about_me_content": "Learn more about Marek Święchowicz, a Quality Assurance Engineer. Discover my journey, projects, and what drives my passion for programming.",
  "contact_link": "Contact",
  "profile_pic_alt": "Marek's Profile Picture",
  "lightbulb_pic_alt": "Lightbulb",
  "biography_heading": "Biography",
  "biography_paragraph_1": "I began my tech career at Geeknauts, mastering web and mobile application development through solo and team projects. During this time, I was lent to RabeSoft and VisualSoft as a Frontend Engineer, focusing on UI/UX with React Native, and later to Eternis as a Full-Stack Engineer, using Next.js, Chakra UI, and Strapi for responsive web interfaces.",
  "biography_paragraph_2": "Transitioning to Thundersoft, I worked as a Test Engineer, deepening my understanding of software quality standards. Most recently, at UBIQUITY SERVICE, I advanced to a Quality Assurance role. This progression leverages my software engineering background to ensure high-quality standards, making me adept at identifying issues early and enhancing overall product quality.",
  "biography_paragraph_3": "Throughout my career, I've grown continuously, seamlessly transitioning from development to quality assurance, demonstrating my commitment to delivering top-tier software solutions.",
  "satisfied_clients_heading": "Satisfied Clients",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Projects Completed",
  "years_of_experience_heading": "Years of Experience",
  "skills_heading": "My Skills",
  "experience_heading": "Experience",
  "education_heading": "Education",
  "passion_fuels_purpose": "Passion Fuels Purpose!",
  "home": "Home",
  "about": "About",
  "projects": "Projects",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "skills": "Skills",
  "experienceTitle": "Experience",
  "workDescriptionGeeknauts": "I worked on web and mobile application development both in a team and independently; as part of a team, I collaborated on complex projects for various clients, and in solo roles, I managed the full spectrum of development tasks from concept to completion.",
  "workDescriptionRabeSoft": "I took on the role of a frontend engineer for the mobile DinnerDate app, focusing on enhancing user interface and experience. My work involved implementing interactive design elements and ensuring seamless functionality across various devices.",
  "workDescriptionVisualSoft": "I was the sole frontend developer for the Smartkid app, leveraging React Native for cross-platform functionality and Fastlane for streamlined deployment. My work involved building a rich user interface and integrating key features using modern tools like Firebase and Redux for robust app performance.",
  "workDescriptionEternis": "During the development of the Eternis website, I employed Next.js and Strapi for efficient performance and content management. My contribution also involved implementing Chakra UI to achieve a responsive and user-friendly interface.",
  "workDescriptionThunderSoft": "As a Test Engineer Specialist at ThunderSoft, I directly engaged in software testing. My work also involved collaborating with the development team to improve product functionality and user experience, contributing to the high quality and efficiency of the software.",
  "workDescriptionUBIQUITYSERVICE": "At UBIQUITY SERVICE, I ensure software quality through manual and automated testing, developing and executing comprehensive test plans. I collaborate closely with the development team to track and resolve defects, contributing to continuous quality improvement and enhancing user experience.",
  "educationTitle": "Education",
  "bachelor": "Bachelor Of Science In Computer Science",
  "bachelorAcademy": "Cracow University of Technology",
  "bachelorInfo": "Relevant courses included Data Structures and Algorithms, Computer Systems Engineering, and Artificial Intelligence",
  "masters": "Master of Science in Computer Science, Specialization in Cybersecurity",
  "mastersAcademy": "Cracow University of Technology",
  "mastersInfo": "The Master's coursework included hands-on experience with security assessment and penetration testing tools such as Nmap, SonarQube, and Burp Suite, emphasizing practical approaches to vulnerability analysis and network security.",
  "allRightsReserved": "All Rights Reserved.",
  "buildWithLove": "Build With",
  "by": "by",
  "sayHello": "Say Hello",
  "projects_header": "Imagination Trumps Knowledge",
  "Marka": "Mark",
  "CKeditor_title": "REST API and CKEditor 5 Real-Time Collaboration Showcase",
  "CKEditor_summary": "This project demonstrates my expertise in configuring and testing REST APIs, with a focus on real-time collaboration features. It includes several projects and tasks, each addressing specific aspects of API integration and testing."
}
