{
  "animated_text": "Od tworzenia oprogramowania do zapewniania jakości przez testowanie",
  "developer_description": "Kiedyś doświadczony programista aplikacji webowych, obecnie  zaangażowany inżynier testów, przekształcając pomysły w solidne i niezawodne aplikacje poprzez implementację kompleksowych strategii testowania i zapewnianie najwyższych standardów jakości.",
  "resume_button": "CV",
  "contact_link": "Kontakt",
  "profile_pic_alt": "Zdjęcie profilowe Marka",
  "lightbulb_pic_alt": "Żarówka",
  "biography_heading": "Biografia",
  "biography_paragraph_1": "Jako profesjonalista w branży technologicznej, zbudowałem solidne fundamenty w Geeknauts, gdzie rozpoczęła się moja przygoda z rozwojem aplikacji webowych i mobilnych. W Geeknauts podejmowałem zarówno indywidualne, jak i zespołowe projekty, doskonaląc sztukę radzenia sobie z złożonymi wyzwaniami i dostarczając innowacyjne rozwiązania. Ta rola miała kluczowe znaczenie w kształtowaniu moich umiejętności technicznych i zdolności do współpracy, przygotowując grunt pod moje przyszłe przedsięwzięcia.",
  "biography_paragraph_2": "Moje doświadczenie otworzyło mi drzwi do możliwości współpracy z innymi firmami, co pozwoliło mi poszerzyć moje doświadczenie w różnorodnych środowiskach. W RabeSoft i VisualSoft objąłem rolę Frontend Developera, zagłębiając się w projektowanie interfejsów użytkownika i poprawę doświadczeń użytkowników. Wykorzystując narzędzia takie jak React Native i Firebase, przyczyniłem się do tworzenia aplikacji, które były nie tylko wizualnie atrakcyjne, ale także funkcjonalnie solidne. Moja praca w Eternis jako Inżynier Full-Stack jeszcze bardziej rozszerzyła moje umiejętności, gdzie użyłem Next.js i Chakra UI do tworzenia responsywnych interfejsów webowych, demonstrując moją wszechstronność w radzeniu sobie z różnymi aspektami rozwoju oprogramowania.",
  "biography_paragraph_3": "W każdym projekcie staram się wykorzystać moje umiejętności i entuzjazm, aby zrealizować Twoją wizję. Z niecierpliwością oczekuję na możliwość wniesienia mojej wiedzy i świeżego spojrzenia do Twojego kolejnego projektu.",
  "satisfied_clients_heading": "Zadowoleni Klienci",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Zakończone Projekty",
  "years_of_experience_heading": "Lata Doświadczenia",
  "skills_heading": "Moje Umiejętności",
  "experience_heading": "Doświadczenie",
  "education_heading": "Edukacja",
  "passion_fuels_purpose": "Pasja napędza cel!",
  "home": "Strona główna",
  "about": "O mnie",
  "projects": "Projekty",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "menuButton": "Menu",
  "skills": "Umiejętności",
  "experienceTitle": "Doświadczenie",
  "workDescriptionGeeknauts": "Pracowałem nad rozwojem aplikacji webowych i mobilnych zarówno w zespole, jak i samodzielnie; jako część zespołu współpracowałem nad złożonymi projektami dla różnych klientów, a w rolach solowych zarządzałem pełnym spektrum zadań rozwojowych od koncepcji do realizacji.",
  "workDescriptionRabeSoft": "Podjąłem rolę inżyniera frontendu w aplikacji mobilnej DinnerDate, skupiając się na ulepszaniu interfejsu użytkownika i doświadczenia użytkownika. Moja praca obejmowała wdrażanie interaktywnych elementów projektu i zapewnianie płynnej funkcjonalności na różnych urządzeniach.",
  "workDescriptionVisualSoft": "Byłem jedynym programistą frontendu aplikacji Smartkid, wykorzystując React Native dla funkcjonalności cross-platform i Fastlane dla uproszczonego wdrożenia. Moja praca obejmowała budowanie bogatego interfejsu użytkownika i integrację kluczowych funkcji za pomocą nowoczesnych narzędzi, takich jak Firebase i Redux, dla solidnej wydajności aplikacji.",
  "workDescriptionEternis": "Podczas opracowywania strony internetowej Eternis, wykorzystałem Next.js i Strapi dla efektywnej wydajności i zarządzania treścią. Mój wkład obejmował również wdrożenie Chakra UI, aby osiągnąć responsywny i przyjazny dla użytkownika interfejs.",
  "workDescriptionThunderSoft": "Jako Specjalista ds. Zapewnienia Jakości w ThunderSoft, bezpośrednio zajmuję się testowaniem oprogramowania. Moja praca obejmuje także współpracę z zespołem programistów w celu polepszenia funkcjonalności produktu i doświadczeń użytkownika, co przyczynia się do zapewnienia wysokiej jakości i efektywności oprogramowania.",
  "educationTitle": "Edukacja",
  "batchelor": "Inżynier Informatyki",
  "batchelorAcademy": "Politechnika Krakowska",
  "batchelorInfo": "Do istotnych kursów należały Struktury Danych i Algorytmy, Inżynieria Systemów Komputerowych oraz Sztuczna Inteligencja",
  "masters": "Magister Informatyki, Specjalizacja Cyberbezpieczeństwo",
  "mastersAcademy": "Politechnika Krakowska",
  "mastersInfo": "Studia magisterskie obejmowały praktyczne doświadczenie z narzędziami do oceny bezpieczeństwa i testowania penetracyjnego, takimi jak Nmap, SonarQube, Burp Suite z naciskiem na praktyczne podejścia do analizy podatności i bezpieczeństwa.",
  "allRightsReserved": "Wszystkie prawa zastrzeżone.",
  "buildWithLove": "Stworzone z",
  "by": "przez",
  "sayHello": "Przywitaj się"
}
