{
  "animated_text": "Od tworzenia oprogramowania do zapewniania jakości przez testowanie",
  "developer_description": "Posiadam doświadczenie full-stack, ale dziś skupiam się przede wszystkim na jakości. Dbam o nią na każdym etapie produktu, łącząc podejście manualne i automatyzację, aby trafnie oceniać złożone systemy, wyłapywać nieoczywiste scenariusze i wspierać sprawne, przewidywalne wdrożenia. Moim celem jest tworzenie rozwiązań, które pomagają zespołom dostarczać stabilne, dopracowane i wygodne w użyciu aplikacje.",
  "resume_button": "CV",
  "page_title": "Marek Święchowicz",
  "page_description": "Odkryj projekty, portfolio i doświadczenie zawodowe Marka Święchowicza.",
  "about_me_content": "Dowiedz się więcej o Marku Święchowiczu, Inżynierze Zapewnienia Jakości. Odkryj moją drogę, projekty i to, co napędza moją pasję do programowania.",
  "contact_link": "Kontakt",
  "profile_pic_alt": "Zdjęcie profilowe Marka",
  "lightbulb_pic_alt": "Żarówka",
  "biography_heading": "Biografia",
  "biography_paragraph_1": "Swoją drogę w branży technologicznej rozpocząłem w Geeknauts, gdzie zbudowałem solidne podstawy w tworzeniu aplikacji webowych i mobilnych. Pracując zarówno samodzielnie, jak i w zespołach, skupiałem się na projektowaniu intuicyjnych doświadczeń użytkownika i niezawodnych funkcjonalności, rozwijając wszechstronność i inżynierskie myślenie.",
  "biography_paragraph_2": "W kolejnych etapach kariery, w Thundersoft i 3mk, naturalnie przeszedłem w obszar inżynierii jakości, przejmując odpowiedzialność za testowanie złożonych systemów. Ta ścieżka doprowadziła mnie do SiriusXM, gdzie zajmuję się automatyzacją, walidacją integracji i niezawodnością systemową w aplikacjach wykorzystywanych w dużej skali w środowisku motoryzacyjnym.",
  "satisfied_clients_heading": "Zadowoleni Klienci",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Zakończone Projekty",
  "years_of_experience_heading": "Lata Doświadczenia",
  "skills_heading": "Moje Umiejętności",
  "experience_heading": "Doświadczenie",
  "education_heading": "Edukacja",
  "passion_fuels_purpose": "Pasja napędza cel!",
  "home": "Strona główna",
  "about": "O mnie",
  "projects": "Projekty",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "menuButton": "Menu",
  "skills": "Umiejętności",
  "experienceTitle": "Doświadczenie",
  "workDescriptionGeeknauts": "Pracowałem nad tworzeniem aplikacji webowych i mobilnych, realizując zadania zarówno samodzielnie, jak i w projektach zespołowych. Dostarczałem funkcjonalności frontendowe i backendowe, poprawiałem wydajność i użyteczność oraz wspierałem procesy release. To doświadczenie zbudowało fundament inżynierski, który później umożliwił mi naturalne przejście do inżynierii jakości i automatyzacji.",
  "workDescriptionThunderSoft": "W ThunderSoft testowałem systemy infotainment i rozwiązania connected-car, wykonując testy funkcjonalne i integracyjne w środowiskach embedded. Analizowałem logi, przepływy komunikacji backendowej oraz wspierałem proces przygotowania wydań. Blisko współpracowałem z developerami, pomagając poprawiać stabilność i jakość systemu.",
  "workDescription3MK": "W 3MK odpowiadałem za kompleksową jakość produktów — od backendu, przez aplikację webową, po mobilną. Tworzyłem i realizowałem plany testów, wykonywałem testy eksploracyjne i regresyjne oraz wspierałem rozwój automatyzacji w Playwright + TypeScript. Jako jedyny QA w zespole dbałem o pełne pokrycie testowe, jasną komunikację ryzyk oraz współpracę z developerami i product ownerem.",
  "workDescriptionSiriusXM": "Jako Quality Engineer w SiriusXM zajmuję się walidacją aplikacji samochodowych wykorzystywanych w dużym ekosystemie motoryzacyjnym. Skupiam się na niezawodności systemu, automatyzacji oraz testach integracyjnych, aby zapewnić wysoką jakość wydań w warunkach zbliżonych do rzeczywistych. Do moich zadań należy projektowanie i wykonywanie strategii testowych, analiza zachowania systemu oraz współpraca z zespołami inżynieryjnymi w Irlandii i USA.",
  "educationTitle": "Edukacja",
  "bachelor": "Inżynier Informatyki",
  "bachelorAcademy": "Politechnika Krakowska",
  "bachelorInfo": "Do istotnych kursów należały Struktury Danych i Algorytmy, Inżynieria Systemów Komputerowych oraz Sztuczna Inteligencja",
  "masters": "Magister Informatyki, Specjalizacja Cyberbezpieczeństwo",
  "mastersAcademy": "Politechnika Krakowska",
  "mastersInfo": "Studia magisterskie obejmowały praktyczne doświadczenie z narzędziami do oceny bezpieczeństwa i testowania penetracyjnego, takimi jak Nmap, SonarQube, Burp Suite z naciskiem na praktyczne podejścia do analizy podatności i bezpieczeństwa.",
  "allRightsReserved": "Wszystkie prawa zastrzeżone.",
  "buildWithLove": "Stworzone z",
  "by": "przez",
  "sayHello": "Przywitaj się",
  "projects_header": "Wyobraźnia przewyższa wiedzę!",
  "Marka": "Marka",
  "CKEditor_title": "REST API i CKEditor 5 Real-Time Collaboration Showcase",
  "CKEditor_summary": "Ten projekt demonstruje moje umiejętności w konfigurowaniu i testowaniu REST API, z naciskiem na funkcje współpracy w czasie rzeczywistym. Zawiera kilka projektów i zadań, z których każde dotyczy określonych aspektów integracji i testowania API.",
  "CKEditor_projectType": "Wyróżniony Projekt",
  "T-mobile_projectType": "Testowanie automatyczne interfejsu użytkownika",
  "T-mobile_title": "Automatyzacja Zakupu Produktu T-Mobile",
  "T-mobile_summary": "Ten projekt demonstruje automatyczne testowanie procesu zakupu produktu na stronie internetowej T-Mobile z użyciem Selenium WebDriver z Java i Cucumber.",
  "TMExpress_projectType": "Statyczna strona internetowa",
  "portfolio_title": "Moja strona internetowa",
  "portfolio_projectType": "Portfolio",
  "portfolio_summary": "Ta strona portfolio została stworzona przy użyciu Next.js, Tailwind CSS i TypeScript",
  "saucedemo_title": "Automatyzacja formularza logowania SauceDemo",
  "saucedemo_projectType": "Testowanie automatyczne WebDriverIO",
  "saucedemo_summary": "Framework testów automatycznych dla walidacji formularza logowania SauceDemo wykorzystujący WebDriverIO z wzorcem Page Object. Testy obejmują puste dane, częściowe dane wejściowe i scenariusze pomyślnego logowania w przeglądarkach Chrome i Firefox z równoległym wykonaniem i testowaniem opartym na danych.",
  "open_menu": "Otwórz menu",
  "close_menu": "Zamknij menu"
}
