{
  "animated_text": "Przekształcam Wizję W Rzeczywistość Za Pomocą Kodowania I Projektowania.",
  "developer_description": "Jako doświadczony programista full-stack, jestem zaangażowany w przekształcanie pomysłów w innowacyjne aplikacje internetowe. Zapoznaj się z moimi najnowszymi projektami i artykułami, prezentującymi moją wiedzę na temat React.js i rozwoju stron internetowych.",
  "resume_button": "CV",
  "contact_link": "Kontakt",
  "profile_pic_alt": "Zdjęcie profilowe Marka",
  "lightbulb_pic_alt": "Żarówka",
  "biography_heading": "Biografia",
  "biography_paragraph_1": "Cześć, jestem Marek, programista webowy z rocznym doświadczeniem w tworzeniu funkcjonalnych i przyjaznych dla użytkownika rozwiązań cyfrowych. Cenię sobie dostarczanie projektów, które nie tylko cieszą oko, ale również rozwiązują rzeczywiste problemy i zapewniają płynne doświadczenia użytkownika.",
  "biography_paragraph_2": "Wierzę, że świetny design to coś więcej niż wygląd - chodzi o tworzenie rozwiązań i przyjemnych interakcji. Moje zainteresowania rozciągają się na różne środki cyfrowe, od stron internetowych po aplikacje mobilne, gdzie stosuję moje zaangażowanie w doskonałość projektowania i zasady skoncentrowane na użytkowniku.",
  "biography_paragraph_3": "W każdym projekcie dążę do wykorzystania moich umiejętności i entuzjazmu do realizacji Twojej wizji. Z niecierpliwością pragnę wnosić moją wiedzę i świeże spojrzenie do Twojego następnego projektu.",
  "satisfied_clients_heading": "Zadowoleni Klienci",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Zakończone Projekty",
  "projects_completed_number": "20",
  "years_of_experience_heading": "Lata Doświadczenia",
  "years_of_experience_number": "1",
  "skills_heading": "Moje Umiejętności",
  "experience_heading": "Doświadczenie",
  "education_heading": "Edukacja",
  "passion_fuels_purpose": "Pasja napędza cel!",
  "home": "Strona główna",
  "about": "O mnie",
  "projects": "Projekty",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "menuButton": "Menu",
  "skills": "Umiejętności",
  "experienceTitle": "Doświadczenie",
  "workDescriptionGeeknauts": "Pracowałem nad rozwojem aplikacji webowych i mobilnych zarówno w zespole, jak i samodzielnie; jako część zespołu współpracowałem nad złożonymi projektami dla różnych klientów, a w rolach solowych zarządzałem pełnym spektrum zadań rozwojowych od koncepcji do realizacji.",
  "workDescriptionRabeSoft": "Podjąłem rolę inżyniera frontendu w aplikacji mobilnej DinnerDate, skupiając się na ulepszaniu interfejsu użytkownika i doświadczenia użytkownika. Moja praca obejmowała wdrażanie interaktywnych elementów projektu i zapewnianie płynnej funkcjonalności na różnych urządzeniach.",
  "workDescriptionVisualSoft": "Byłem jedynym programistą frontendu aplikacji Smartkid, wykorzystując React Native dla funkcjonalności cross-platform i Fastlane dla uproszczonego wdrożenia. Moja praca obejmowała budowanie bogatego interfejsu użytkownika i integrację kluczowych funkcji za pomocą nowoczesnych narzędzi, takich jak Firebase i Redux, dla solidnej wydajności aplikacji.",
  "workDescriptionEternis": "Podczas opracowywania strony internetowej Eternis, wykorzystałem Next.js i Strapi dla efektywnej wydajności i zarządzania treścią. Mój wkład obejmował również wdrożenie Chakra UI, aby osiągnąć responsywny i przyjazny dla użytkownika interfejs.",
  "workDescriptionThunderSoft": "Jako Specjalista ds. Zapewnienia Jakości w ThunderSoft, bezpośrednio zajmuję się testowaniem oprogramowania, wykrywając i rozwiązując defekty z użyciem narzędzia JIRA do śledzenia błędów. Moja praca obejmuje także współpracę z zespołem programistów w celu polepszenia funkcjonalności produktu i doświadczeń użytkownika, co przyczynia się do zapewnienia wysokiej jakości i efektywności oprogramowania.",
  "educationTitle": "Edukacja",
  "batchelor": "Inżynier Informatyki",
  "batchelorAcademy": "Politechnika Krakowska",
  "batchelorInfo": "Do istotnych kursów należały Struktury Danych i Algorytmy, Inżynieria Systemów Komputerowych oraz Sztuczna Inteligencja",
  "masters": "Magister Informatyki, Specjalizacja Cyberbezpieczeństwo",
  "mastersAcademy": "Politechnika Krakowska",
  "mastersInfo": "Studia magisterskie obejmowały praktyczne doświadczenie z narzędziami do oceny bezpieczeństwa i testowania penetracyjnego, takimi jak Nmap, SonarQube, Burp Suite z naciskiem na praktyczne podejścia do analizy podatności i bezpieczeństwa.",
  "allRightsReserved": "Wszystkie prawa zastrzeżone.",
  "buildWithLove": "Stworzone z",
  "by": "przez",
  "sayHello": "Przywitaj się"
}
