{
  "animated_text": "Od tworzenia oprogramowania do zapewniania jakości przez testowanie",
  "developer_description": "Dawniej doświadczony programista aplikacji webowych, obecnie zaangażowany inżynier testów – przekształcam pomysły w solidne i niezawodne aplikacje, wdrażając kompleksowe strategie testowania i dbając o najwyższe standardy jakości.",
  "resume_button": "CV",
  "page_title": "Marek Święchowicz",
  "page_description": "Odkryj projekty, portfolio i doświadczenie zawodowe Marka Święchowicza.",
  "about_me_content": "Dowiedz się więcej o Marku Święchowiczu, Inżynierze Zapewnienia Jakości. Odkryj moją drogę, projekty i to, co napędza moją pasję do programowania.",
  "contact_link": "Kontakt",
  "profile_pic_alt": "Zdjęcie profilowe Marka",
  "lightbulb_pic_alt": "Żarówka",
  "biography_heading": "Biografia",
  "biography_paragraph_1": "Rozpocząłem swoją przygodę z technologią w Geeknauts, gdzie zdobyłem solidne podstawy w tworzeniu aplikacji webowych i mobilnych. Pracując zarówno nad projektami indywidualnymi, jak i zespołowymi, zdobyłem doświadczenie w projektowaniu intuicyjnych interfejsów użytkownika oraz rozwiązywaniu złożonych wyzwań związanych z programowaniem full-stack, co pozwoliło mi wykazać się elastycznością i umiejętnościami technicznymi.",
  "biography_paragraph_2": "Moje przejście do Thundersoft było istotnym krokiem w mojej karierze, ponieważ objąłem tam rolę QA'a. To stanowisko pozwoliło mi pogłębić wiedzę na temat standardów jakości oprogramowania i wdrożyć skrupulatne praktyki testowe, które zapewniały solidne i wydajne aplikacje.",
  "biography_paragraph_3": "Obecnie pełnię funkcję specjalisty ds. zapewniania jakości w firmie 3MK, gdzie koncentruję się na testowaniu aplikacji webow, mobilnych oraz systemów backendowych. Moja kariera odzwierciedla płynne przejście od programowania do zapewniania jakości, co podkreśla moje zaangażowanie w dostarczanie wyjątkowych i niezawodnych rozwiązań programistycznych poprzez nieustanny rozwój i innowacje.",
  "satisfied_clients_heading": "Zadowoleni Klienci",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Zakończone Projekty",
  "years_of_experience_heading": "Lata Doświadczenia",
  "skills_heading": "Moje Umiejętności",
  "experience_heading": "Doświadczenie",
  "education_heading": "Edukacja",
  "passion_fuels_purpose": "Pasja napędza cel!",
  "home": "Strona główna",
  "about": "O mnie",
  "projects": "Projekty",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "menuButton": "Menu",
  "skills": "Umiejętności",
  "experienceTitle": "Doświadczenie",
  "workDescriptionGeeknauts": "Pracowałem nad rozwojem aplikacji webowych i mobilnych zarówno w zespole, jak i samodzielnie; jako część zespołu współpracowałem nad złożonymi projektami dla różnych klientów, a w rolach solowych zarządzałem pełnym spektrum zadań rozwojowych od koncepcji do realizacji.",
  "workDescriptionRabeSoft": "Pełniłem rolę inżyniera frontendu w aplikacji mobilnej DinnerDate, skupiając się na ulepszaniu interfejsu użytkownika i doświadczenia użytkownika. Moja praca obejmowała wdrażanie interaktywnych elementów projektu i zapewnianie płynnej funkcjonalności na różnych urządzeniach.",
  "workDescriptionVisualSoft": "Byłem jedynym programistą frontendu aplikacji Smartkid, wykorzystując React Native dla funkcjonalności cross-platform i Fastlane dla uproszczonego wdrożenia. Moja praca obejmowała budowanie bogatego interfejsu użytkownika i integrację kluczowych funkcji za pomocą nowoczesnych narzędzi, takich jak Firebase i Redux, dla solidnej wydajności aplikacji.",
  "workDescriptionEternis": "Podczas opracowywania strony internetowej Eternis, wykorzystywałem Next.js i Strapi dla efektywnej wydajności i zarządzania treścią. Moim wkładem było również wdrożenie Chakra UI, aby osiągnąć responsywny i przyjazny dla użytkownika interfejs.",
  "workDescriptionThunderSoft": "Jako Specjalista ds. Zapewnienia Jakości w ThunderSoft, bezpośrednio zajmowałem się testowaniem oprogramowania. Moja praca obejmowała również współpracę z zespołem programistów w celu polepszenia funkcjonalności produktu i doświadczeń użytkownika, co przyczyniało się do zapewnienia wysokiej jakości i efektywności oprogramowania.",
  "workDescriptionUBIQUITYSERVICE": "W UBIQUITY SERVICE dbałem o jakość oprogramowania poprzez testy manualne i automatyczne, tworzenie i realizację kompleksowych planów testowych. Ściśle współpracowałem z zespołem deweloperów, aby śledzić i rozwiązywać defekty, co przyczyniało się do ciągłego doskonalenia jakości oraz poprawy doświadczeń użytkowników.",
  "workDescription3MK": "W 3MK jestem odpowiedzialny za testowanie i walidację rozwiązań oprogramowania, zapewniając najwyższe standardy jakości. Moja praca obejmowała opracowywanie planów testowych, realizację przypadków testowych oraz identyfikację i rozwiązywanie defektów w celu poprawy ogólnej jakości produktu.",
  "workDescriptionSiriusXM": "Jako Inżynier ds. Zapewnienia Jakości w SiriusXM zajmuje się zapewnieniem jakości oprogramowania poprzez tworzenie i realizację planów testowych, identyfikację i rozwiązywanie defektów, oraz współpracę z zespołem deweloperów w celu poprawy jakości produktów.",
  "educationTitle": "Edukacja",
  "bachelor": "Inżynier Informatyki",
  "bachelorAcademy": "Politechnika Krakowska",
  "bachelorInfo": "Do istotnych kursów należały Struktury Danych i Algorytmy, Inżynieria Systemów Komputerowych oraz Sztuczna Inteligencja",
  "masters": "Magister Informatyki, Specjalizacja Cyberbezpieczeństwo",
  "mastersAcademy": "Politechnika Krakowska",
  "mastersInfo": "Studia magisterskie obejmowały praktyczne doświadczenie z narzędziami do oceny bezpieczeństwa i testowania penetracyjnego, takimi jak Nmap, SonarQube, Burp Suite z naciskiem na praktyczne podejścia do analizy podatności i bezpieczeństwa.",
  "allRightsReserved": "Wszystkie prawa zastrzeżone.",
  "buildWithLove": "Stworzone z",
  "by": "przez",
  "sayHello": "Przywitaj się",
  "projects_header": "Wyobraźnia przewyższa wiedzę!",
  "Marka": "Marka",
  "CKEditor_title": "REST API i CKEditor 5 Real-Time Collaboration Showcase",
  "CKEditor_summary": "Ten projekt demonstruje moje umiejętności w konfigurowaniu i testowaniu REST API, z naciskiem na funkcje współpracy w czasie rzeczywistym. Zawiera kilka projektów i zadań, z których każde dotyczy określonych aspektów integracji i testowania API.",
  "CKEditor_projectType": "Wyróżniony Projekt",
  "T-mobile_projectType": "Testowanie automatyczne interfejsu użytkownika",
  "T-mobile_title": "Automatyzacja Zakupu Produktu T-Mobile",
  "T-mobile_summary": "Ten projekt demonstruje automatyczne testowanie procesu zakupu produktu na stronie internetowej T-Mobile z użyciem Selenium WebDriver z Java i Cucumber.",
  "TMExpress_projectType": "Statyczna strona internetowa",
  "portfolio_title": "Moja strona internetowa",
  "portfolio_projectType": "Portfolio",
  "portfolio_summary": "Ta strona portfolio została stworzona przy użyciu Next.js, Tailwind CSS i TypeScript"
}
