{
  "animated_text": "Od tworzenia oprogramowania do zapewniania jakości przez testowanie",
  "developer_description": "Kiedyś doświadczony programista aplikacji webowych, obecnie  zaangażowany inżynier testów, przekształcając pomysły w solidne i niezawodne aplikacje poprzez implementację kompleksowych strategii testowania i zapewnianie najwyższych standardów jakości.",
  "resume_button": "CV",
  "contact_link": "Kontakt",
  "profile_pic_alt": "Zdjęcie profilowe Marka",
  "lightbulb_pic_alt": "Żarówka",
  "biography_heading": "Biografia",
  "biography_paragraph_1": "Rozpocząłem swoją karierę w branży technologicznej w Geeknauts, doskonaląc umiejętności w zakresie tworzenia aplikacji webowych i mobilnych. W tym czasie byłem delegowany do RabeSoft i VisualSoft jako Frontend Engineer, koncentrując się na UI/UX z użyciem React Native, a później do Eternis jako Full-Stack Engineer, gdzie wykorzystywałem Next.js, Chakra UI i Strapi.",
  "biography_paragraph_2": "Następnie, w Thundersoft, pracowałem jako Test Engineer, pogłębiając swoją wiedzę na temat standardów jakości oprogramowania. Najnowszym krokiem w mojej karierze było przejście do roli Quality Assurance w UBIQUITY SERVICE. Ten rozwój pozwolił mi wykorzystać doświadczenie w inżynierii oprogramowania do zapewnienia najwyższych standardów jakości, wczesnego wykrywania problemów i poprawy ogólnej jakości produktu.",
  "biography_paragraph_3": "W trakcie mojej kariery nieustannie się rozwijałem, płynnie przechodząc od rozwoju oprogramowania do zapewniania jakości, demonstrując moje zaangażowanie w dostarczanie najwyższej jakości rozwiązań software'owych.",
  "satisfied_clients_heading": "Zadowoleni Klienci",
  "satisfied_clients_number": "10",
  "projects_completed_heading": "Zakończone Projekty",
  "years_of_experience_heading": "Lata Doświadczenia",
  "skills_heading": "Moje Umiejętności",
  "experience_heading": "Doświadczenie",
  "education_heading": "Edukacja",
  "passion_fuels_purpose": "Pasja napędza cel!",
  "home": "Strona główna",
  "about": "O mnie",
  "projects": "Projekty",
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "menuButton": "Menu",
  "skills": "Umiejętności",
  "experienceTitle": "Doświadczenie",
  "workDescriptionGeeknauts": "Pracowałem nad rozwojem aplikacji webowych i mobilnych zarówno w zespole, jak i samodzielnie; jako część zespołu współpracowałem nad złożonymi projektami dla różnych klientów, a w rolach solowych zarządzałem pełnym spektrum zadań rozwojowych od koncepcji do realizacji.",
  "workDescriptionRabeSoft": "Podjąłem rolę inżyniera frontendu w aplikacji mobilnej DinnerDate, skupiając się na ulepszaniu interfejsu użytkownika i doświadczenia użytkownika. Moja praca obejmowała wdrażanie interaktywnych elementów projektu i zapewnianie płynnej funkcjonalności na różnych urządzeniach.",
  "workDescriptionVisualSoft": "Byłem jedynym programistą frontendu aplikacji Smartkid, wykorzystując React Native dla funkcjonalności cross-platform i Fastlane dla uproszczonego wdrożenia. Moja praca obejmowała budowanie bogatego interfejsu użytkownika i integrację kluczowych funkcji za pomocą nowoczesnych narzędzi, takich jak Firebase i Redux, dla solidnej wydajności aplikacji.",
  "workDescriptionEternis": "Podczas opracowywania strony internetowej Eternis, wykorzystałem Next.js i Strapi dla efektywnej wydajności i zarządzania treścią. Mój wkład obejmował również wdrożenie Chakra UI, aby osiągnąć responsywny i przyjazny dla użytkownika interfejs.",
  "workDescriptionThunderSoft": "Jako Specjalista ds. Zapewnienia Jakości w ThunderSoft, bezpośrednio zajmowałem się testowaniem oprogramowania. Moja praca obejmowała także współpracę z zespołem programistów w celu polepszenia funkcjonalności produktu i doświadczeń użytkownika, co przyczyniało się do zapewnienia wysokiej jakości i efektywności oprogramowania.",
  "workDescriptionUBIQUITYSERVICE": "W UBIQUITY SERVICE dbam o jakość oprogramowania poprzez testy manualne i automatyczne, tworzenie i realizację kompleksowych planów testowych. Ściśle współpracuję z zespołem deweloperów, aby śledzić i rozwiązywać defekty, co przyczynia się do ciągłego doskonalenia jakości oraz poprawy doświadczeń użytkowników.",
  "educationTitle": "Edukacja",
  "bachelor": "Inżynier Informatyki",
  "bachelorAcademy": "Politechnika Krakowska",
  "bachelorInfo": "Do istotnych kursów należały Struktury Danych i Algorytmy, Inżynieria Systemów Komputerowych oraz Sztuczna Inteligencja",
  "masters": "Magister Informatyki, Specjalizacja Cyberbezpieczeństwo",
  "mastersAcademy": "Politechnika Krakowska",
  "mastersInfo": "Studia magisterskie obejmowały praktyczne doświadczenie z narzędziami do oceny bezpieczeństwa i testowania penetracyjnego, takimi jak Nmap, SonarQube, Burp Suite z naciskiem na praktyczne podejścia do analizy podatności i bezpieczeństwa.",
  "allRightsReserved": "Wszystkie prawa zastrzeżone.",
  "buildWithLove": "Stworzone z",
  "by": "przez",
  "sayHello": "Przywitaj się"
}
